FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/rtc_reg.h
     * |[29]    |TAMP5LV   |Tamper 5 Level
     * |        |          |This bit depend on level attribute of tamper pin for static tamper detection.
     * |        |          |0 = Detect voltage level is low.
     * |        |          |1 = Detect voltage level is high.
     * |[30]    |TAMP5DBEN |Tamper 5 De-bounce Enable Bit
     * |        |          |0 = Tamper 5 de-bounce Disabled.
     * |        |          |1 = Tamper 5 de-bounce Enabled.
     * |[31]    |DYNPR2EN  |Dynamic Pair 2 Enable Bit
     * |        |          |0 = Static detect.
     * |        |          |1 = Dynamic detect.
     * @var RTC_T::TAMPSEED
     * Offset: 0x128  RTC Tamper Dynamic Seed Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |SEED      |Seed Value
     * @var RTC_T::TAMPTIME
     * Offset: 0x130  RTC Tamper Time Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |SEC       |1-Sec Time Digit of TAMPER Time (0~9)
     * |[6:4]   |TENSEC    |10-Sec Time Digit of TAMPER Time (0~5)
     * |[11:8]  |MIN       |1-Min Time Digit of TAMPER Time (0~9)
     * |[14:12] |TENMIN    |10-Min Time Digit of TAMPER Time (0~5)
     * |[19:16] |HR        |1-Hour Time Digit of TAMPER Time (0~9)
     * |[21:20] |TENHR     |10-Hour Time Digit of TAMPER Time (0~2) Note: 24-hour time scale only .
     * |[30:24] |HZCNT     |Index of sub-second counter(0x00 ~0x7F)
     * @var RTC_T::TAMPCAL
     * Offset: 0x134  RTC Tamper Calendar Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |DAY       |1-Day Calendar Digit of TAMPER Calendar (0~9)
     * |[5:4]   |TENDAY    |10-Day Calendar Digit of TAMPER Calendar (0~3)
     * |[11:8]  |MON       |1-Month Calendar Digit of TAMPER Calendar (0~9)
     * |[12]    |TENMON    |10-Month Calendar Digit of TAMPER Calendar (0~1)
     * |[19:16] |YEAR      |1-Year Calendar Digit of TAMPER Calendar (0~9)
     * |[23:20] |TENYEAR   |10-Year Calendar Digit of TAMPER Calendar (0~9)
     * @var RTC_T::CLKDCTL
     * Offset: 0x140  Clock Fail Detector Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |LXTFDEN   |LXT Clock Fail/Stop Detector Enable Bit
     * |        |          |0 = LXT clock fail/stop detector Disabled.
     * |        |          |1 = LXT clock fail/stop detector Enabled.
     * |        |          |Note:
     * |[1]     |LXTFSW    |LXT Clock Fail Detector Switch LIRC32K Enable Bit
     * |        |          |0 = LXT Clock Fail Detector Switch LIRC32K Disabled.
     * |        |          |1 = Enabled
     * |        |          |If LXT clock fail detector flag CLKFIF (RTC_INTSTS[24]) is generated, RTC clock source will switch to LIRC32K automatically.
     * |[2]     |LXTSPSW   |LXT Clock Stop Detector Switch LIRC32K Enable Bit
     * |        |          |0 = LXT Clock Stop Detector Switch LIRC32K Disabled.
     * |        |          |1 = Enabled
     * |        |          |If LXT clock stop detector flag CLKSPIF (RTC_INTSTS[25]) is generated, RTC clock source will switch to LIRC32K automatically
     * |[16]    |CLKSWLIRCF|LXT Clock Detector Fail/Stop Switch LIRC32K Flag (Read Only)
     * |        |          |0 = RTC clock source from LXT.
     * |        |          |1 = RTC clock source from LIRC32K .
     * |[17]    |LXTFASTF  |LXT Faster Than LIRX32K Flag (Read Only)
     * |        |          |0 = LXT frequency is slowly.
     * |        |          |1 = LXT frequency faster than LIRC32K.
     * @var RTC_T::CDBR
     * Offset: 0x144  Clock Frequency Detector Boundary Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |STOPBD    |LXT Clock Frequency Detector Stop Boundary
     * |        |          |The bits define the stop value of frequency monitor window.
     * |        |          |When LXT frequency monitor counter lower than Clock Frequency Detector Stop Boundary , the LXT frequency detect Stop interrupt flag will set to 1.
     * |        |          |Note: The boundary is defined as the maximum value of LXT among 256 LIRC32K clock time.
     * |[23:16] |FAILBD    |LXT Clock Frequency Detector Fail Boundary
     * |        |          |The bits define the fail value of frequency monitor window.
     * |        |          |When LXT frequency monitor counter lower than Clock Frequency Detector fail Boundary , the LXT frequency detect fail interrupt flag will set to 1.
     * |        |          |Note: The boundary is defined as the minimum value of LXT among 256 LIRC32K clock time.
     */
    __IO uint32_t INIT;          /*!< [0x0000] RTC Initiation Register                                          */
    __IO uint32_t RWEN;          /*!< [0x0004] RTC Access Enable Register                                       */
    __IO uint32_t FREQADJ;       /*!< [0x0008] RTC Frequency Compensation Register                              */
    __IO uint32_t TIME;          /*!< [0x000c] RTC Time Loading Register                                        */
    __IO uint32_t CAL;           /*!< [0x0010] RTC Calendar Loading Register                                    */
    __IO uint32_t CLKFMT;        /*!< [0x0014] RTC Time Scale Selection Register                                */
    __IO uint32_t WEEKDAY;       /*!< [0x0018] RTC Day of the Week Register                                     */
    __IO uint32_t TALM;          /*!< [0x001c] RTC Time Alarm Register                                          */
    __IO uint32_t CALM;          /*!< [0x0020] RTC Calendar Alarm Register                                      */
    __I uint32_t LEAPYEAR;       /*!< [0x0024] RTC Leap Year Indicator Register                                 */
    __IO uint32_t INTEN;         /*!< [0x0028] RTC Interrupt Enable Register                                    */
    __IO uint32_t INTSTS;        /*!< [0x002c] RTC Interrupt Status Register                                    */
    __IO uint32_t TICK;          /*!< [0x0030] RTC Time Tick Register                                           */
    __IO uint32_t TAMSK;         /*!< [0x0034] RTC Time Alarm Mask Register                                     */
    __IO uint32_t CAMSK;         /*!< [0x0038] RTC Calendar Alarm Mask Register                                 */
    __IO uint32_t SPRCTL;        /*!< [0x003c] RTC Spare Functional Control Register                            */
    __IO uint32_t SPR[ 20 ];     /*!< [0x0040] ~ [0x008C] RTC Spare Register 0 ~ 19                             */
    __I uint32_t RESERVE0[ 28 ]; /* 0x90 ~ 0xFC */
    __IO uint32_t LXTCTL;        /*!< [0x0100] RTC 32.768 kHz Oscillator Control Register                       */
    __IO uint32_t GPIOCTL0;      /*!< [0x0104] RTC GPIO Control 0 Register                                      */
    __IO uint32_t GPIOCTL1;      /*!< [0x0108] RTC GPIO Control 1 Register                                      */
    __I uint32_t RESERVE1[ 1 ];
    __IO uint32_t DSTCTL;        /*!< [0x0110] RTC Daylight Saving Time Control Register                        */
    __I uint32_t RESERVE2[ 3 ];
    __IO uint32_t TAMPCTL;       /*!< [0x0120] RTC Tamper Pin Control Register                                  */
    __I uint32_t RESERVE3[ 1 ];
    __IO uint32_t TAMPSEED;      /*!< [0x0128] RTC Tamper Dynamic Seed Register                                 */
    __I uint32_t RESERVE4[ 1 ];
    __I uint32_t TAMPTIME;       /*!< [0x0130] RTC Tamper Time Register                                         */
    __I uint32_t TAMPCAL;        /*!< [0x0134] RTC Tamper Calendar Register                                     */
    __I uint32_t RESERVE5[ 2 ];
    __IO uint32_t CLKDCTL;       /*!< [0x0140] Clock Fail Detector Control Register                             */
    __IO uint32_t CDBR;          /*!< [0x0144] Clock Frequency Detector Boundary Register                       */
} RTC_T;

/**
 *  @addtogroup RTC_CONST RTC Bit Field Definition
 *  Constant Definitions for RTC Controller
 * @{ */

#define RTC_INIT_ACTIVE_Pos           ( 0 )                                                /*!< RTC_T::INIT: ACTIVE Position           */
#define RTC_INIT_ACTIVE_Msk           ( 0x1ul << RTC_INIT_ACTIVE_Pos )                     /*!< RTC_T::INIT: ACTIVE Mask               */

#define RTC_INIT_INIT_Pos             ( 1 )                                                /*!< RTC_T::INIT: INIT Position             */
#define RTC_INIT_INIT_Msk             ( 0x7ffffffful << RTC_INIT_INIT_Pos )                /*!< RTC_T::INIT: INIT Mask                 */

