FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/rtc_reg.h
#define RTC_RWEN_RWEN_Pos             ( 0 )                                                /*!< RTC_T::RWEN: RWEN Position             */
#define RTC_RWEN_RWEN_Msk             ( 0xfffful << RTC_RWEN_RWEN_Pos )                    /*!< RTC_T::RWEN: RWEN Mask                 */

#define RTC_RWEN_RWENF_Pos            ( 16 )                                               /*!< RTC_T::RWEN: RWENF Position            */
#define RTC_RWEN_RWENF_Msk            ( 0x1ul << RTC_RWEN_RWENF_Pos )                      /*!< RTC_T::RWEN: RWENF Mask                */

#define RTC_RWEN_RTCBUSY_Pos          ( 24 )                                               /*!< RTC_T::RWEN: RTCBUSY Position          */
#define RTC_RWEN_RTCBUSY_Msk          ( 0x1ul << RTC_RWEN_RTCBUSY_Pos )                    /*!< RTC_T::RWEN: RTCBUSY Mask              */

#define RTC_FREQADJ_FREQADJ_Pos       ( 0 )                                                /*!< RTC_T::FREQADJ: FREQADJ Position       */
#define RTC_FREQADJ_FREQADJ_Msk       ( 0x3ffffful << RTC_FREQADJ_FREQADJ_Pos )            /*!< RTC_T::FREQADJ: FREQADJ Mask           */

#define RTC_TIME_SEC_Pos              ( 0 )                                                /*!< RTC_T::TIME: SEC Position              */
#define RTC_TIME_SEC_Msk              ( 0xful << RTC_TIME_SEC_Pos )                        /*!< RTC_T::TIME: SEC Mask                  */

#define RTC_TIME_TENSEC_Pos           ( 4 )                                                /*!< RTC_T::TIME: TENSEC Position           */
#define RTC_TIME_TENSEC_Msk           ( 0x7ul << RTC_TIME_TENSEC_Pos )                     /*!< RTC_T::TIME: TENSEC Mask               */

#define RTC_TIME_MIN_Pos              ( 8 )                                                /*!< RTC_T::TIME: MIN Position              */
#define RTC_TIME_MIN_Msk              ( 0xful << RTC_TIME_MIN_Pos )                        /*!< RTC_T::TIME: MIN Mask                  */

#define RTC_TIME_TENMIN_Pos           ( 12 )                                               /*!< RTC_T::TIME: TENMIN Position           */
#define RTC_TIME_TENMIN_Msk           ( 0x7ul << RTC_TIME_TENMIN_Pos )                     /*!< RTC_T::TIME: TENMIN Mask               */

#define RTC_TIME_HR_Pos               ( 16 )                                               /*!< RTC_T::TIME: HR Position               */
#define RTC_TIME_HR_Msk               ( 0xful << RTC_TIME_HR_Pos )                         /*!< RTC_T::TIME: HR Mask                   */

#define RTC_TIME_TENHR_Pos            ( 20 )                                               /*!< RTC_T::TIME: TENHR Position            */
#define RTC_TIME_TENHR_Msk            ( 0x3ul << RTC_TIME_TENHR_Pos )                      /*!< RTC_T::TIME: TENHR Mask                */

#define RTC_TIME_HZCNT_Pos            ( 24 )                                               /*!< RTC_T::TIME: HZCNT Position            */
#define RTC_TIME_HZCNT_Msk            ( 0x7ful << RTC_TIME_HZCNT_Pos )                     /*!< RTC_T::TIME: HZCNT Mask                */

#define RTC_CAL_DAY_Pos               ( 0 )                                                /*!< RTC_T::CAL: DAY Position               */
#define RTC_CAL_DAY_Msk               ( 0xful << RTC_CAL_DAY_Pos )                         /*!< RTC_T::CAL: DAY Mask                   */

#define RTC_CAL_TENDAY_Pos            ( 4 )                                                /*!< RTC_T::CAL: TENDAY Position            */
#define RTC_CAL_TENDAY_Msk            ( 0x3ul << RTC_CAL_TENDAY_Pos )                      /*!< RTC_T::CAL: TENDAY Mask                */

#define RTC_CAL_MON_Pos               ( 8 )                                                /*!< RTC_T::CAL: MON Position               */
#define RTC_CAL_MON_Msk               ( 0xful << RTC_CAL_MON_Pos )                         /*!< RTC_T::CAL: MON Mask                   */

#define RTC_CAL_TENMON_Pos            ( 12 )                                               /*!< RTC_T::CAL: TENMON Position            */
#define RTC_CAL_TENMON_Msk            ( 0x1ul << RTC_CAL_TENMON_Pos )                      /*!< RTC_T::CAL: TENMON Mask                */

#define RTC_CAL_YEAR_Pos              ( 16 )                                               /*!< RTC_T::CAL: YEAR Position              */
#define RTC_CAL_YEAR_Msk              ( 0xful << RTC_CAL_YEAR_Pos )                        /*!< RTC_T::CAL: YEAR Mask                  */

#define RTC_CAL_TENYEAR_Pos           ( 20 )                                               /*!< RTC_T::CAL: TENYEAR Position           */
#define RTC_CAL_TENYEAR_Msk           ( 0xful << RTC_CAL_TENYEAR_Pos )                     /*!< RTC_T::CAL: TENYEAR Mask               */

#define RTC_CLKFMT_24HEN_Pos          ( 0 )                                                /*!< RTC_T::CLKFMT: 24HEN Position          */
#define RTC_CLKFMT_24HEN_Msk          ( 0x1ul << RTC_CLKFMT_24HEN_Pos )                    /*!< RTC_T::CLKFMT: 24HEN Mask              */

#define RTC_CLKFMT_HZCNTEN_Pos        ( 8 )                                                /*!< RTC_T::CLKFMT: HZCNTEN Position        */
#define RTC_CLKFMT_HZCNTEN_Msk        ( 0x1ul << RTC_CLKFMT_HZCNTEN_Pos )                  /*!< RTC_T::CLKFMT: HZCNTEN Mask            */

#define RTC_WEEKDAY_WEEKDAY_Pos       ( 0 )                                                /*!< RTC_T::WEEKDAY: WEEKDAY Position       */
#define RTC_WEEKDAY_WEEKDAY_Msk       ( 0x7ul << RTC_WEEKDAY_WEEKDAY_Pos )                 /*!< RTC_T::WEEKDAY: WEEKDAY Mask           */

#define RTC_TALM_SEC_Pos              ( 0 )                                                /*!< RTC_T::TALM: SEC Position              */
#define RTC_TALM_SEC_Msk              ( 0xful << RTC_TALM_SEC_Pos )                        /*!< RTC_T::TALM: SEC Mask                  */

#define RTC_TALM_TENSEC_Pos           ( 4 )                                                /*!< RTC_T::TALM: TENSEC Position           */
#define RTC_TALM_TENSEC_Msk           ( 0x7ul << RTC_TALM_TENSEC_Pos )                     /*!< RTC_T::TALM: TENSEC Mask               */

