FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/rtc_reg.h
#define RTC_TALM_MIN_Pos              ( 8 )                                                /*!< RTC_T::TALM: MIN Position              */
#define RTC_TALM_MIN_Msk              ( 0xful << RTC_TALM_MIN_Pos )                        /*!< RTC_T::TALM: MIN Mask                  */

#define RTC_TALM_TENMIN_Pos           ( 12 )                                               /*!< RTC_T::TALM: TENMIN Position           */
#define RTC_TALM_TENMIN_Msk           ( 0x7ul << RTC_TALM_TENMIN_Pos )                     /*!< RTC_T::TALM: TENMIN Mask               */

#define RTC_TALM_HR_Pos               ( 16 )                                               /*!< RTC_T::TALM: HR Position               */
#define RTC_TALM_HR_Msk               ( 0xful << RTC_TALM_HR_Pos )                         /*!< RTC_T::TALM: HR Mask                   */

#define RTC_TALM_TENHR_Pos            ( 20 )                                               /*!< RTC_T::TALM: TENHR Position            */
#define RTC_TALM_TENHR_Msk            ( 0x3ul << RTC_TALM_TENHR_Pos )                      /*!< RTC_T::TALM: TENHR Mask                */

#define RTC_TALM_HZCNT_Pos            ( 24 )                                               /*!< RTC_T::TALM: HZCNT Position            */
#define RTC_TALM_HZCNT_Msk            ( 0x7ful << RTC_TALM_HZCNT_Pos )                     /*!< RTC_T::TALM: HZCNT Mask                */

#define RTC_CALM_DAY_Pos              ( 0 )                                                /*!< RTC_T::CALM: DAY Position              */
#define RTC_CALM_DAY_Msk              ( 0xful << RTC_CALM_DAY_Pos )                        /*!< RTC_T::CALM: DAY Mask                  */

#define RTC_CALM_TENDAY_Pos           ( 4 )                                                /*!< RTC_T::CALM: TENDAY Position           */
#define RTC_CALM_TENDAY_Msk           ( 0x3ul << RTC_CALM_TENDAY_Pos )                     /*!< RTC_T::CALM: TENDAY Mask               */

#define RTC_CALM_MON_Pos              ( 8 )                                                /*!< RTC_T::CALM: MON Position              */
#define RTC_CALM_MON_Msk              ( 0xful << RTC_CALM_MON_Pos )                        /*!< RTC_T::CALM: MON Mask                  */

#define RTC_CALM_TENMON_Pos           ( 12 )                                               /*!< RTC_T::CALM: TENMON Position           */
#define RTC_CALM_TENMON_Msk           ( 0x1ul << RTC_CALM_TENMON_Pos )                     /*!< RTC_T::CALM: TENMON Mask               */

#define RTC_CALM_YEAR_Pos             ( 16 )                                               /*!< RTC_T::CALM: YEAR Position             */
#define RTC_CALM_YEAR_Msk             ( 0xful << RTC_CALM_YEAR_Pos )                       /*!< RTC_T::CALM: YEAR Mask                 */

#define RTC_CALM_TENYEAR_Pos          ( 20 )                                               /*!< RTC_T::CALM: TENYEAR Position          */
#define RTC_CALM_TENYEAR_Msk          ( 0xful << RTC_CALM_TENYEAR_Pos )                    /*!< RTC_T::CALM: TENYEAR Mask              */

#define RTC_LEAPYEAR_LEAPYEAR_Pos     ( 0 )                                                /*!< RTC_T::LEAPYEAR: LEAPYEAR Position     */
#define RTC_LEAPYEAR_LEAPYEAR_Msk     ( 0x1ul << RTC_LEAPYEAR_LEAPYEAR_Pos )               /*!< RTC_T::LEAPYEAR: LEAPYEAR Mask         */

#define RTC_INTEN_ALMIEN_Pos          ( 0 )                                                /*!< RTC_T::INTEN: ALMIEN Position          */
#define RTC_INTEN_ALMIEN_Msk          ( 0x1ul << RTC_INTEN_ALMIEN_Pos )                    /*!< RTC_T::INTEN: ALMIEN Mask              */

#define RTC_INTEN_TICKIEN_Pos         ( 1 )                                                /*!< RTC_T::INTEN: TICKIEN Position         */
#define RTC_INTEN_TICKIEN_Msk         ( 0x1ul << RTC_INTEN_TICKIEN_Pos )                   /*!< RTC_T::INTEN: TICKIEN Mask             */

#define RTC_INTEN_TAMP0IEN_Pos        ( 8 )                                                /*!< RTC_T::INTEN: TAMP0IEN Position        */
#define RTC_INTEN_TAMP0IEN_Msk        ( 0x1ul << RTC_INTEN_TAMP0IEN_Pos )                  /*!< RTC_T::INTEN: TAMP0IEN Mask            */

#define RTC_INTEN_TAMP1IEN_Pos        ( 9 )                                                /*!< RTC_T::INTEN: TAMP1IEN Position        */
#define RTC_INTEN_TAMP1IEN_Msk        ( 0x1ul << RTC_INTEN_TAMP1IEN_Pos )                  /*!< RTC_T::INTEN: TAMP1IEN Mask            */

#define RTC_INTEN_TAMP2IEN_Pos        ( 10 )                                               /*!< RTC_T::INTEN: TAMP2IEN Position        */
#define RTC_INTEN_TAMP2IEN_Msk        ( 0x1ul << RTC_INTEN_TAMP2IEN_Pos )                  /*!< RTC_T::INTEN: TAMP2IEN Mask            */

#define RTC_INTEN_TAMP3IEN_Pos        ( 11 )                                               /*!< RTC_T::INTEN: TAMP3IEN Position        */
#define RTC_INTEN_TAMP3IEN_Msk        ( 0x1ul << RTC_INTEN_TAMP3IEN_Pos )                  /*!< RTC_T::INTEN: TAMP3IEN Mask            */

#define RTC_INTEN_TAMP4IEN_Pos        ( 12 )                                               /*!< RTC_T::INTEN: TAMP4IEN Position        */
#define RTC_INTEN_TAMP4IEN_Msk        ( 0x1ul << RTC_INTEN_TAMP4IEN_Pos )                  /*!< RTC_T::INTEN: TAMP4IEN Mask            */

#define RTC_INTEN_TAMP5IEN_Pos        ( 13 )                                               /*!< RTC_T::INTEN: TAMP5IEN Position        */
#define RTC_INTEN_TAMP5IEN_Msk        ( 0x1ul << RTC_INTEN_TAMP5IEN_Pos )                  /*!< RTC_T::INTEN: TAMP5IEN Mask            */

#define RTC_INTEN_CLKFIEN_Pos         ( 24 )                                               /*!< RTC_T::INTEN: CLKFIEN Position         */
#define RTC_INTEN_CLKFIEN_Msk         ( 0x1ul << RTC_INTEN_CLKFIEN_Pos )                   /*!< RTC_T::INTEN: CLKFIEN Mask             */

#define RTC_INTEN_CLKSPIEN_Pos        ( 25 )                                               /*!< RTC_T::INTEN: CLKSPIEN Position        */
#define RTC_INTEN_CLKSPIEN_Msk        ( 0x1ul << RTC_INTEN_CLKSPIEN_Pos )                  /*!< RTC_T::INTEN: CLKSPIEN Mask            */

