FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/rtc_reg.h
#define RTC_INTSTS_ALMIF_Pos          ( 0 )                                                /*!< RTC_T::INTSTS: ALMIF Position          */
#define RTC_INTSTS_ALMIF_Msk          ( 0x1ul << RTC_INTSTS_ALMIF_Pos )                    /*!< RTC_T::INTSTS: ALMIF Mask              */

#define RTC_INTSTS_TICKIF_Pos         ( 1 )                                                /*!< RTC_T::INTSTS: TICKIF Position         */
#define RTC_INTSTS_TICKIF_Msk         ( 0x1ul << RTC_INTSTS_TICKIF_Pos )                   /*!< RTC_T::INTSTS: TICKIF Mask             */

#define RTC_INTSTS_TAMP0IF_Pos        ( 8 )                                                /*!< RTC_T::INTSTS: TAMP0IF Position        */
#define RTC_INTSTS_TAMP0IF_Msk        ( 0x1ul << RTC_INTSTS_TAMP0IF_Pos )                  /*!< RTC_T::INTSTS: TAMP0IF Mask            */

#define RTC_INTSTS_TAMP1IF_Pos        ( 9 )                                                /*!< RTC_T::INTSTS: TAMP1IF Position        */
#define RTC_INTSTS_TAMP1IF_Msk        ( 0x1ul << RTC_INTSTS_TAMP1IF_Pos )                  /*!< RTC_T::INTSTS: TAMP1IF Mask            */

#define RTC_INTSTS_TAMP2IF_Pos        ( 10 )                                               /*!< RTC_T::INTSTS: TAMP2IF Position        */
#define RTC_INTSTS_TAMP2IF_Msk        ( 0x1ul << RTC_INTSTS_TAMP2IF_Pos )                  /*!< RTC_T::INTSTS: TAMP2IF Mask            */

#define RTC_INTSTS_TAMP3IF_Pos        ( 11 )                                               /*!< RTC_T::INTSTS: TAMP3IF Position        */
#define RTC_INTSTS_TAMP3IF_Msk        ( 0x1ul << RTC_INTSTS_TAMP3IF_Pos )                  /*!< RTC_T::INTSTS: TAMP3IF Mask            */

#define RTC_INTSTS_TAMP4IF_Pos        ( 12 )                                               /*!< RTC_T::INTSTS: TAMP4IF Position        */
#define RTC_INTSTS_TAMP4IF_Msk        ( 0x1ul << RTC_INTSTS_TAMP4IF_Pos )                  /*!< RTC_T::INTSTS: TAMP4IF Mask            */

#define RTC_INTSTS_TAMP5IF_Pos        ( 13 )                                               /*!< RTC_T::INTSTS: TAMP5IF Position        */
#define RTC_INTSTS_TAMP5IF_Msk        ( 0x1ul << RTC_INTSTS_TAMP5IF_Pos )                  /*!< RTC_T::INTSTS: TAMP5IF Mask            */

#define RTC_INTSTS_CLKFIF_Pos         ( 24 )                                               /*!< RTC_T::INTSTS: CLKFIF Position         */
#define RTC_INTSTS_CLKFIF_Msk         ( 0x1ul << RTC_INTSTS_CLKFIF_Pos )                   /*!< RTC_T::INTSTS: CLKFIF Mask             */

#define RTC_INTSTS_CLKSPIF_Pos        ( 25 )                                               /*!< RTC_T::INTSTS: CLKSPIF Position        */
#define RTC_INTSTS_CLKSPIF_Msk        ( 0x1ul << RTC_INTSTS_CLKSPIF_Pos )                  /*!< RTC_T::INTSTS: CLKSPIF Mask            */

#define RTC_TICK_TICK_Pos             ( 0 )                                                /*!< RTC_T::TICK: TICK Position             */
#define RTC_TICK_TICK_Msk             ( 0x7ul << RTC_TICK_TICK_Pos )                       /*!< RTC_T::TICK: TICK Mask                 */

#define RTC_TAMSK_MSEC_Pos            ( 0 )                                                /*!< RTC_T::TAMSK: MSEC Position            */
#define RTC_TAMSK_MSEC_Msk            ( 0x1ul << RTC_TAMSK_MSEC_Pos )                      /*!< RTC_T::TAMSK: MSEC Mask                */

#define RTC_TAMSK_MTENSEC_Pos         ( 1 )                                                /*!< RTC_T::TAMSK: MTENSEC Position         */
#define RTC_TAMSK_MTENSEC_Msk         ( 0x1ul << RTC_TAMSK_MTENSEC_Pos )                   /*!< RTC_T::TAMSK: MTENSEC Mask             */

#define RTC_TAMSK_MMIN_Pos            ( 2 )                                                /*!< RTC_T::TAMSK: MMIN Position            */
#define RTC_TAMSK_MMIN_Msk            ( 0x1ul << RTC_TAMSK_MMIN_Pos )                      /*!< RTC_T::TAMSK: MMIN Mask                */

#define RTC_TAMSK_MTENMIN_Pos         ( 3 )                                                /*!< RTC_T::TAMSK: MTENMIN Position         */
#define RTC_TAMSK_MTENMIN_Msk         ( 0x1ul << RTC_TAMSK_MTENMIN_Pos )                   /*!< RTC_T::TAMSK: MTENMIN Mask             */

#define RTC_TAMSK_MHR_Pos             ( 4 )                                                /*!< RTC_T::TAMSK: MHR Position             */
#define RTC_TAMSK_MHR_Msk             ( 0x1ul << RTC_TAMSK_MHR_Pos )                       /*!< RTC_T::TAMSK: MHR Mask                 */

#define RTC_TAMSK_MTENHR_Pos          ( 5 )                                                /*!< RTC_T::TAMSK: MTENHR Position          */
#define RTC_TAMSK_MTENHR_Msk          ( 0x1ul << RTC_TAMSK_MTENHR_Pos )                    /*!< RTC_T::TAMSK: MTENHR Mask              */

#define RTC_CAMSK_MDAY_Pos            ( 0 )                                                /*!< RTC_T::CAMSK: MDAY Position            */
#define RTC_CAMSK_MDAY_Msk            ( 0x1ul << RTC_CAMSK_MDAY_Pos )                      /*!< RTC_T::CAMSK: MDAY Mask                */

#define RTC_CAMSK_MTENDAY_Pos         ( 1 )                                                /*!< RTC_T::CAMSK: MTENDAY Position         */
#define RTC_CAMSK_MTENDAY_Msk         ( 0x1ul << RTC_CAMSK_MTENDAY_Pos )                   /*!< RTC_T::CAMSK: MTENDAY Mask             */

#define RTC_CAMSK_MMON_Pos            ( 2 )                                                /*!< RTC_T::CAMSK: MMON Position            */
#define RTC_CAMSK_MMON_Msk            ( 0x1ul << RTC_CAMSK_MMON_Pos )                      /*!< RTC_T::CAMSK: MMON Mask                */

#define RTC_CAMSK_MTENMON_Pos         ( 3 )                                                /*!< RTC_T::CAMSK: MTENMON Position         */
#define RTC_CAMSK_MTENMON_Msk         ( 0x1ul << RTC_CAMSK_MTENMON_Pos )                   /*!< RTC_T::CAMSK: MTENMON Mask             */

#define RTC_CAMSK_MYEAR_Pos           ( 4 )                                                /*!< RTC_T::CAMSK: MYEAR Position           */
#define RTC_CAMSK_MYEAR_Msk           ( 0x1ul << RTC_CAMSK_MYEAR_Pos )                     /*!< RTC_T::CAMSK: MYEAR Mask               */

#define RTC_CAMSK_MTENYEAR_Pos        ( 5 )                                                /*!< RTC_T::CAMSK: MTENYEAR Position        */
#define RTC_CAMSK_MTENYEAR_Msk        ( 0x1ul << RTC_CAMSK_MTENYEAR_Pos )                  /*!< RTC_T::CAMSK: MTENYEAR Mask            */

#define RTC_SPRCTL_SPRRWEN_Pos        ( 2 )                                                /*!< RTC_T::SPRCTL: SPRRWEN Position        */
#define RTC_SPRCTL_SPRRWEN_Msk        ( 0x1ul << RTC_SPRCTL_SPRRWEN_Pos )                  /*!< RTC_T::SPRCTL: SPRRWEN Mask            */

#define RTC_SPRCTL_SPRCSTS_Pos        ( 5 )                                                /*!< RTC_T::SPRCTL: SPRCSTS Position        */
#define RTC_SPRCTL_SPRCSTS_Msk        ( 0x1ul << RTC_SPRCTL_SPRCSTS_Pos )                  /*!< RTC_T::SPRCTL: SPRCSTS Mask            */

#define RTC_SPRCTL_LXTFCLR_Pos        ( 16 )                                               /*!< RTC_T::SPRCTL: LXTFCLR Position        */
#define RTC_SPRCTL_LXTFCLR_Msk        ( 0x1ul << RTC_SPRCTL_LXTFCLR_Pos )                  /*!< RTC_T::SPRCTL: LXTFCLR Mask            */

#define RTC_SPR0_SPARE_Pos            ( 0 )                                                /*!< RTC_T::SPR0: SPARE Position            */
#define RTC_SPR0_SPARE_Msk            ( 0xfffffffful << RTC_SPR0_SPARE_Pos )               /*!< RTC_T::SPR0: SPARE Mask                */

#define RTC_SPR1_SPARE_Pos            ( 0 )                                                /*!< RTC_T::SPR1: SPARE Position            */
#define RTC_SPR1_SPARE_Msk            ( 0xfffffffful << RTC_SPR1_SPARE_Pos )               /*!< RTC_T::SPR1: SPARE Mask                */

#define RTC_SPR2_SPARE_Pos            ( 0 )                                                /*!< RTC_T::SPR2: SPARE Position            */
#define RTC_SPR2_SPARE_Msk            ( 0xfffffffful << RTC_SPR2_SPARE_Pos )               /*!< RTC_T::SPR2: SPARE Mask                */

#define RTC_SPR3_SPARE_Pos            ( 0 )                                                /*!< RTC_T::SPR3: SPARE Position            */
#define RTC_SPR3_SPARE_Msk            ( 0xfffffffful << RTC_SPR3_SPARE_Pos )               /*!< RTC_T::SPR3: SPARE Mask                */

#define RTC_SPR4_SPARE_Pos            ( 0 )                                                /*!< RTC_T::SPR4: SPARE Position            */
#define RTC_SPR4_SPARE_Msk            ( 0xfffffffful << RTC_SPR4_SPARE_Pos )               /*!< RTC_T::SPR4: SPARE Mask                */

#define RTC_SPR5_SPARE_Pos            ( 0 )                                                /*!< RTC_T::SPR5: SPARE Position            */
#define RTC_SPR5_SPARE_Msk            ( 0xfffffffful << RTC_SPR5_SPARE_Pos )               /*!< RTC_T::SPR5: SPARE Mask                */

#define RTC_SPR6_SPARE_Pos            ( 0 )                                                /*!< RTC_T::SPR6: SPARE Position            */
#define RTC_SPR6_SPARE_Msk            ( 0xfffffffful << RTC_SPR6_SPARE_Pos )               /*!< RTC_T::SPR6: SPARE Mask                */

#define RTC_SPR7_SPARE_Pos            ( 0 )                                                /*!< RTC_T::SPR7: SPARE Position            */
#define RTC_SPR7_SPARE_Msk            ( 0xfffffffful << RTC_SPR7_SPARE_Pos )               /*!< RTC_T::SPR7: SPARE Mask                */

#define RTC_SPR8_SPARE_Pos            ( 0 )                                                /*!< RTC_T::SPR8: SPARE Position            */
#define RTC_SPR8_SPARE_Msk            ( 0xfffffffful << RTC_SPR8_SPARE_Pos )               /*!< RTC_T::SPR8: SPARE Mask                */

