FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/rtc_reg.h
#define RTC_SPR9_SPARE_Pos            ( 0 )                                                /*!< RTC_T::SPR9: SPARE Position            */
#define RTC_SPR9_SPARE_Msk            ( 0xfffffffful << RTC_SPR9_SPARE_Pos )               /*!< RTC_T::SPR9: SPARE Mask                */

#define RTC_SPR10_SPARE_Pos           ( 0 )                                                /*!< RTC_T::SPR10: SPARE Position           */
#define RTC_SPR10_SPARE_Msk           ( 0xfffffffful << RTC_SPR10_SPARE_Pos )              /*!< RTC_T::SPR10: SPARE Mask               */

#define RTC_SPR11_SPARE_Pos           ( 0 )                                                /*!< RTC_T::SPR11: SPARE Position           */
#define RTC_SPR11_SPARE_Msk           ( 0xfffffffful << RTC_SPR11_SPARE_Pos )              /*!< RTC_T::SPR11: SPARE Mask               */

#define RTC_SPR12_SPARE_Pos           ( 0 )                                                /*!< RTC_T::SPR12: SPARE Position           */
#define RTC_SPR12_SPARE_Msk           ( 0xfffffffful << RTC_SPR12_SPARE_Pos )              /*!< RTC_T::SPR12: SPARE Mask               */

#define RTC_SPR13_SPARE_Pos           ( 0 )                                                /*!< RTC_T::SPR13: SPARE Position           */
#define RTC_SPR13_SPARE_Msk           ( 0xfffffffful << RTC_SPR13_SPARE_Pos )              /*!< RTC_T::SPR13: SPARE Mask               */

#define RTC_SPR14_SPARE_Pos           ( 0 )                                                /*!< RTC_T::SPR14: SPARE Position           */
#define RTC_SPR14_SPARE_Msk           ( 0xfffffffful << RTC_SPR14_SPARE_Pos )              /*!< RTC_T::SPR14: SPARE Mask               */

#define RTC_SPR15_SPARE_Pos           ( 0 )                                                /*!< RTC_T::SPR15: SPARE Position           */
#define RTC_SPR15_SPARE_Msk           ( 0xfffffffful << RTC_SPR15_SPARE_Pos )              /*!< RTC_T::SPR15: SPARE Mask               */

#define RTC_SPR16_SPARE_Pos           ( 0 )                                                /*!< RTC_T::SPR16: SPARE Position           */
#define RTC_SPR16_SPARE_Msk           ( 0xfffffffful << RTC_SPR16_SPARE_Pos )              /*!< RTC_T::SPR16: SPARE Mask               */

#define RTC_SPR17_SPARE_Pos           ( 0 )                                                /*!< RTC_T::SPR17: SPARE Position           */
#define RTC_SPR17_SPARE_Msk           ( 0xfffffffful << RTC_SPR17_SPARE_Pos )              /*!< RTC_T::SPR17: SPARE Mask               */

#define RTC_SPR18_SPARE_Pos           ( 0 )                                                /*!< RTC_T::SPR18: SPARE Position           */
#define RTC_SPR18_SPARE_Msk           ( 0xfffffffful << RTC_SPR18_SPARE_Pos )              /*!< RTC_T::SPR18: SPARE Mask               */

#define RTC_SPR19_SPARE_Pos           ( 0 )                                                /*!< RTC_T::SPR19: SPARE Position           */
#define RTC_SPR19_SPARE_Msk           ( 0xfffffffful << RTC_SPR19_SPARE_Pos )              /*!< RTC_T::SPR19: SPARE Mask               */

#define RTC_LXTCTL_LIRC32KEN_Pos      ( 0 )                                                /*!< RTC_T::LXTCTL: LIRC32KEN Position      */
#define RTC_LXTCTL_LIRC32KEN_Msk      ( 0x1ul << RTC_LXTCTL_LIRC32KEN_Pos )                /*!< RTC_T::LXTCTL: LIRC32KEN Mask          */

#define RTC_LXTCTL_GAIN_Pos           ( 1 )                                                /*!< RTC_T::LXTCTL: GAIN Position           */
#define RTC_LXTCTL_GAIN_Msk           ( 0x7ul << RTC_LXTCTL_GAIN_Pos )                     /*!< RTC_T::LXTCTL: GAIN Mask               */

#define RTC_LXTCTL_C32KS_Pos          ( 7 )                                                /*!< RTC_T::LXTCTL: C32KS Position          */
#define RTC_LXTCTL_C32KS_Msk          ( 0x1ul << RTC_LXTCTL_C32KS_Pos )                    /*!< RTC_T::LXTCTL: C32KS Mask              */

#define RTC_GPIOCTL0_OPMODE0_Pos      ( 0 )                                                /*!< RTC_T::GPIOCTL0: OPMODE0 Position      */
#define RTC_GPIOCTL0_OPMODE0_Msk      ( 0x3ul << RTC_GPIOCTL0_OPMODE0_Pos )                /*!< RTC_T::GPIOCTL0: OPMODE0 Mask          */

#define RTC_GPIOCTL0_DOUT0_Pos        ( 2 )                                                /*!< RTC_T::GPIOCTL0: DOUT0 Position        */
#define RTC_GPIOCTL0_DOUT0_Msk        ( 0x1ul << RTC_GPIOCTL0_DOUT0_Pos )                  /*!< RTC_T::GPIOCTL0: DOUT0 Mask            */

#define RTC_GPIOCTL0_CTLSEL0_Pos      ( 3 )                                                /*!< RTC_T::GPIOCTL0: CTLSEL0 Position      */
#define RTC_GPIOCTL0_CTLSEL0_Msk      ( 0x1ul << RTC_GPIOCTL0_CTLSEL0_Pos )                /*!< RTC_T::GPIOCTL0: CTLSEL0 Mask          */

#define RTC_GPIOCTL0_PUSEL0_Pos       ( 4 )                                                /*!< RTC_T::GPIOCTL0: PUSEL0 Position       */
#define RTC_GPIOCTL0_PUSEL0_Msk       ( 0x3ul << RTC_GPIOCTL0_PUSEL0_Pos )                 /*!< RTC_T::GPIOCTL0: PUSEL0 Mask           */

#define RTC_GPIOCTL0_OPMODE1_Pos      ( 8 )                                                /*!< RTC_T::GPIOCTL0: OPMODE1 Position      */
#define RTC_GPIOCTL0_OPMODE1_Msk      ( 0x3ul << RTC_GPIOCTL0_OPMODE1_Pos )                /*!< RTC_T::GPIOCTL0: OPMODE1 Mask          */

#define RTC_GPIOCTL0_DOUT1_Pos        ( 10 )                                               /*!< RTC_T::GPIOCTL0: DOUT1 Position        */
#define RTC_GPIOCTL0_DOUT1_Msk        ( 0x1ul << RTC_GPIOCTL0_DOUT1_Pos )                  /*!< RTC_T::GPIOCTL0: DOUT1 Mask            */

#define RTC_GPIOCTL0_CTLSEL1_Pos      ( 11 )                                               /*!< RTC_T::GPIOCTL0: CTLSEL1 Position      */
#define RTC_GPIOCTL0_CTLSEL1_Msk      ( 0x1ul << RTC_GPIOCTL0_CTLSEL1_Pos )                /*!< RTC_T::GPIOCTL0: CTLSEL1 Mask          */

#define RTC_GPIOCTL0_PUSEL1_Pos       ( 12 )                                               /*!< RTC_T::GPIOCTL0: PUSEL1 Position       */
#define RTC_GPIOCTL0_PUSEL1_Msk       ( 0x3ul << RTC_GPIOCTL0_PUSEL1_Pos )                 /*!< RTC_T::GPIOCTL0: PUSEL1 Mask           */

