FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/rtc_reg.h
#define RTC_DSTCTL_ADDHR_Pos          ( 0 )                                                /*!< RTC_T::DSTCTL: ADDHR Position          */
#define RTC_DSTCTL_ADDHR_Msk          ( 0x1ul << RTC_DSTCTL_ADDHR_Pos )                    /*!< RTC_T::DSTCTL: ADDHR Mask              */

#define RTC_DSTCTL_SUBHR_Pos          ( 1 )                                                /*!< RTC_T::DSTCTL: SUBHR Position          */
#define RTC_DSTCTL_SUBHR_Msk          ( 0x1ul << RTC_DSTCTL_SUBHR_Pos )                    /*!< RTC_T::DSTCTL: SUBHR Mask              */

#define RTC_DSTCTL_DSBAK_Pos          ( 2 )                                                /*!< RTC_T::DSTCTL: DSBAK Position          */
#define RTC_DSTCTL_DSBAK_Msk          ( 0x1ul << RTC_DSTCTL_DSBAK_Pos )                    /*!< RTC_T::DSTCTL: DSBAK Mask              */

#define RTC_TAMPCTL_DYN1ISS_Pos       ( 0 )                                                /*!< RTC_T::TAMPCTL: DYN1ISS Position       */
#define RTC_TAMPCTL_DYN1ISS_Msk       ( 0x1ul << RTC_TAMPCTL_DYN1ISS_Pos )                 /*!< RTC_T::TAMPCTL: DYN1ISS Mask           */

#define RTC_TAMPCTL_DYN2ISS_Pos       ( 1 )                                                /*!< RTC_T::TAMPCTL: DYN2ISS Position       */
#define RTC_TAMPCTL_DYN2ISS_Msk       ( 0x1ul << RTC_TAMPCTL_DYN2ISS_Pos )                 /*!< RTC_T::TAMPCTL: DYN2ISS Mask           */

#define RTC_TAMPCTL_DYNSRC_Pos        ( 2 )                                                /*!< RTC_T::TAMPCTL: DYNSRC Position        */
#define RTC_TAMPCTL_DYNSRC_Msk        ( 0x3ul << RTC_TAMPCTL_DYNSRC_Pos )                  /*!< RTC_T::TAMPCTL: DYNSRC Mask            */

#define RTC_TAMPCTL_SEEDRLD_Pos       ( 4 )                                                /*!< RTC_T::TAMPCTL: SEEDRLD Position       */
#define RTC_TAMPCTL_SEEDRLD_Msk       ( 0x1ul << RTC_TAMPCTL_SEEDRLD_Pos )                 /*!< RTC_T::TAMPCTL: SEEDRLD Mask           */

#define RTC_TAMPCTL_DYNRATE_Pos       ( 5 )                                                /*!< RTC_T::TAMPCTL: DYNRATE Position       */
#define RTC_TAMPCTL_DYNRATE_Msk       ( 0x7ul << RTC_TAMPCTL_DYNRATE_Pos )                 /*!< RTC_T::TAMPCTL: DYNRATE Mask           */

#define RTC_TAMPCTL_TAMP0EN_Pos       ( 8 )                                                /*!< RTC_T::TAMPCTL: TAMP0EN Position       */
#define RTC_TAMPCTL_TAMP0EN_Msk       ( 0x1ul << RTC_TAMPCTL_TAMP0EN_Pos )                 /*!< RTC_T::TAMPCTL: TAMP0EN Mask           */

#define RTC_TAMPCTL_TAMP0LV_Pos       ( 9 )                                                /*!< RTC_T::TAMPCTL: TAMP0LV Position       */
#define RTC_TAMPCTL_TAMP0LV_Msk       ( 0x1ul << RTC_TAMPCTL_TAMP0LV_Pos )                 /*!< RTC_T::TAMPCTL: TAMP0LV Mask           */

#define RTC_TAMPCTL_TAMP0DBEN_Pos     ( 10 )                                               /*!< RTC_T::TAMPCTL: TAMP0DBEN Position     */
#define RTC_TAMPCTL_TAMP0DBEN_Msk     ( 0x1ul << RTC_TAMPCTL_TAMP0DBEN_Pos )               /*!< RTC_T::TAMPCTL: TAMP0DBEN Mask         */

#define RTC_TAMPCTL_TAMP1EN_Pos       ( 12 )                                               /*!< RTC_T::TAMPCTL: TAMP1EN Position       */
#define RTC_TAMPCTL_TAMP1EN_Msk       ( 0x1ul << RTC_TAMPCTL_TAMP1EN_Pos )                 /*!< RTC_T::TAMPCTL: TAMP1EN Mask           */

#define RTC_TAMPCTL_TAMP1LV_Pos       ( 13 )                                               /*!< RTC_T::TAMPCTL: TAMP1LV Position       */
#define RTC_TAMPCTL_TAMP1LV_Msk       ( 0x1ul << RTC_TAMPCTL_TAMP1LV_Pos )                 /*!< RTC_T::TAMPCTL: TAMP1LV Mask           */

#define RTC_TAMPCTL_TAMP1DBEN_Pos     ( 14 )                                               /*!< RTC_T::TAMPCTL: TAMP1DBEN Position     */
#define RTC_TAMPCTL_TAMP1DBEN_Msk     ( 0x1ul << RTC_TAMPCTL_TAMP1DBEN_Pos )               /*!< RTC_T::TAMPCTL: TAMP1DBEN Mask         */

#define RTC_TAMPCTL_DYNPR0EN_Pos      ( 15 )                                               /*!< RTC_T::TAMPCTL: DYNPR0EN Position      */
#define RTC_TAMPCTL_DYNPR0EN_Msk      ( 0x1ul << RTC_TAMPCTL_DYNPR0EN_Pos )                /*!< RTC_T::TAMPCTL: DYNPR0EN Mask          */

#define RTC_TAMPCTL_TAMP2EN_Pos       ( 16 )                                               /*!< RTC_T::TAMPCTL: TAMP2EN Position       */
#define RTC_TAMPCTL_TAMP2EN_Msk       ( 0x1ul << RTC_TAMPCTL_TAMP2EN_Pos )                 /*!< RTC_T::TAMPCTL: TAMP2EN Mask           */

#define RTC_TAMPCTL_TAMP2LV_Pos       ( 17 )                                               /*!< RTC_T::TAMPCTL: TAMP2LV Position       */
#define RTC_TAMPCTL_TAMP2LV_Msk       ( 0x1ul << RTC_TAMPCTL_TAMP2LV_Pos )                 /*!< RTC_T::TAMPCTL: TAMP2LV Mask           */

#define RTC_TAMPCTL_TAMP2DBEN_Pos     ( 18 )                                               /*!< RTC_T::TAMPCTL: TAMP2DBEN Position     */
#define RTC_TAMPCTL_TAMP2DBEN_Msk     ( 0x1ul << RTC_TAMPCTL_TAMP2DBEN_Pos )               /*!< RTC_T::TAMPCTL: TAMP2DBEN Mask         */

#define RTC_TAMPCTL_TAMP3EN_Pos       ( 20 )                                               /*!< RTC_T::TAMPCTL: TAMP3EN Position       */
#define RTC_TAMPCTL_TAMP3EN_Msk       ( 0x1ul << RTC_TAMPCTL_TAMP3EN_Pos )                 /*!< RTC_T::TAMPCTL: TAMP3EN Mask           */

#define RTC_TAMPCTL_TAMP3LV_Pos       ( 21 )                                               /*!< RTC_T::TAMPCTL: TAMP3LV Position       */
#define RTC_TAMPCTL_TAMP3LV_Msk       ( 0x1ul << RTC_TAMPCTL_TAMP3LV_Pos )                 /*!< RTC_T::TAMPCTL: TAMP3LV Mask           */

#define RTC_TAMPCTL_TAMP3DBEN_Pos     ( 22 )                                               /*!< RTC_T::TAMPCTL: TAMP3DBEN Position     */
#define RTC_TAMPCTL_TAMP3DBEN_Msk     ( 0x1ul << RTC_TAMPCTL_TAMP3DBEN_Pos )               /*!< RTC_T::TAMPCTL: TAMP3DBEN Mask         */

#define RTC_TAMPCTL_DYNPR1EN_Pos      ( 23 )                                               /*!< RTC_T::TAMPCTL: DYNPR1EN Position      */
#define RTC_TAMPCTL_DYNPR1EN_Msk      ( 0x1ul << RTC_TAMPCTL_DYNPR1EN_Pos )                /*!< RTC_T::TAMPCTL: DYNPR1EN Mask          */

