FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/rtc_reg.h
#define RTC_TAMPCTL_TAMP4EN_Pos       ( 24 )                                               /*!< RTC_T::TAMPCTL: TAMP4EN Position       */
#define RTC_TAMPCTL_TAMP4EN_Msk       ( 0x1ul << RTC_TAMPCTL_TAMP4EN_Pos )                 /*!< RTC_T::TAMPCTL: TAMP4EN Mask           */

#define RTC_TAMPCTL_TAMP4LV_Pos       ( 25 )                                               /*!< RTC_T::TAMPCTL: TAMP4LV Position       */
#define RTC_TAMPCTL_TAMP4LV_Msk       ( 0x1ul << RTC_TAMPCTL_TAMP4LV_Pos )                 /*!< RTC_T::TAMPCTL: TAMP4LV Mask           */

#define RTC_TAMPCTL_TAMP4DBEN_Pos     ( 26 )                                               /*!< RTC_T::TAMPCTL: TAMP4DBEN Position     */
#define RTC_TAMPCTL_TAMP4DBEN_Msk     ( 0x1ul << RTC_TAMPCTL_TAMP4DBEN_Pos )               /*!< RTC_T::TAMPCTL: TAMP4DBEN Mask         */

#define RTC_TAMPCTL_TAMP5EN_Pos       ( 28 )                                               /*!< RTC_T::TAMPCTL: TAMP5EN Position       */
#define RTC_TAMPCTL_TAMP5EN_Msk       ( 0x1ul << RTC_TAMPCTL_TAMP5EN_Pos )                 /*!< RTC_T::TAMPCTL: TAMP5EN Mask           */

#define RTC_TAMPCTL_TAMP5LV_Pos       ( 29 )                                               /*!< RTC_T::TAMPCTL: TAMP5LV Position       */
#define RTC_TAMPCTL_TAMP5LV_Msk       ( 0x1ul << RTC_TAMPCTL_TAMP5LV_Pos )                 /*!< RTC_T::TAMPCTL: TAMP5LV Mask           */

#define RTC_TAMPCTL_TAMP5DBEN_Pos     ( 30 )                                               /*!< RTC_T::TAMPCTL: TAMP5DBEN Position     */
#define RTC_TAMPCTL_TAMP5DBEN_Msk     ( 0x1ul << RTC_TAMPCTL_TAMP5DBEN_Pos )               /*!< RTC_T::TAMPCTL: TAMP5DBEN Mask         */

#define RTC_TAMPCTL_DYNPR2EN_Pos      ( 31 )                                               /*!< RTC_T::TAMPCTL: DYNPR2EN Position      */
#define RTC_TAMPCTL_DYNPR2EN_Msk      ( 0x1ul << RTC_TAMPCTL_DYNPR2EN_Pos )                /*!< RTC_T::TAMPCTL: DYNPR2EN Mask          */

#define RTC_TAMPSEED_SEED_Pos         ( 0 )                                                /*!< RTC_T::TAMPSEED: SEED Position         */
#define RTC_TAMPSEED_SEED_Msk         ( 0xfffffffful << RTC_TAMPSEED_SEED_Pos )            /*!< RTC_T::TAMPSEED: SEED Mask             */

#define RTC_TAMPTIME_SEC_Pos          ( 0 )                                                /*!< RTC_T::TAMPTIME: SEC Position          */
#define RTC_TAMPTIME_SEC_Msk          ( 0xful << RTC_TAMPTIME_SEC_Pos )                    /*!< RTC_T::TAMPTIME: SEC Mask              */

#define RTC_TAMPTIME_TENSEC_Pos       ( 4 )                                                /*!< RTC_T::TAMPTIME: TENSEC Position       */
#define RTC_TAMPTIME_TENSEC_Msk       ( 0x7ul << RTC_TAMPTIME_TENSEC_Pos )                 /*!< RTC_T::TAMPTIME: TENSEC Mask           */

#define RTC_TAMPTIME_MIN_Pos          ( 8 )                                                /*!< RTC_T::TAMPTIME: MIN Position          */
#define RTC_TAMPTIME_MIN_Msk          ( 0xful << RTC_TAMPTIME_MIN_Pos )                    /*!< RTC_T::TAMPTIME: MIN Mask              */

#define RTC_TAMPTIME_TENMIN_Pos       ( 12 )                                               /*!< RTC_T::TAMPTIME: TENMIN Position       */
#define RTC_TAMPTIME_TENMIN_Msk       ( 0x7ul << RTC_TAMPTIME_TENMIN_Pos )                 /*!< RTC_T::TAMPTIME: TENMIN Mask           */

#define RTC_TAMPTIME_HR_Pos           ( 16 )                                               /*!< RTC_T::TAMPTIME: HR Position           */
#define RTC_TAMPTIME_HR_Msk           ( 0xful << RTC_TAMPTIME_HR_Pos )                     /*!< RTC_T::TAMPTIME: HR Mask               */

#define RTC_TAMPTIME_TENHR_Pos        ( 20 )                                               /*!< RTC_T::TAMPTIME: TENHR Position        */
#define RTC_TAMPTIME_TENHR_Msk        ( 0x3ul << RTC_TAMPTIME_TENHR_Pos )                  /*!< RTC_T::TAMPTIME: TENHR Mask            */

#define RTC_TAMPTIME_HZCNT_Pos        ( 24 )                                               /*!< RTC_T::TAMPTIME: HZCNT Position        */
#define RTC_TAMPTIME_HZCNT_Msk        ( 0x7ful << RTC_TAMPTIME_HZCNT_Pos )                 /*!< RTC_T::TAMPTIME: HZCNT Mask            */

#define RTC_TAMPCAL_DAY_Pos           ( 0 )                                                /*!< RTC_T::TAMPCAL: DAY Position           */
#define RTC_TAMPCAL_DAY_Msk           ( 0xful << RTC_TAMPCAL_DAY_Pos )                     /*!< RTC_T::TAMPCAL: DAY Mask               */

#define RTC_TAMPCAL_TENDAY_Pos        ( 4 )                                                /*!< RTC_T::TAMPCAL: TENDAY Position        */
#define RTC_TAMPCAL_TENDAY_Msk        ( 0x3ul << RTC_TAMPCAL_TENDAY_Pos )                  /*!< RTC_T::TAMPCAL: TENDAY Mask            */

#define RTC_TAMPCAL_MON_Pos           ( 8 )                                                /*!< RTC_T::TAMPCAL: MON Position           */
#define RTC_TAMPCAL_MON_Msk           ( 0xful << RTC_TAMPCAL_MON_Pos )                     /*!< RTC_T::TAMPCAL: MON Mask               */

#define RTC_TAMPCAL_TENMON_Pos        ( 12 )                                               /*!< RTC_T::TAMPCAL: TENMON Position        */
#define RTC_TAMPCAL_TENMON_Msk        ( 0x1ul << RTC_TAMPCAL_TENMON_Pos )                  /*!< RTC_T::TAMPCAL: TENMON Mask            */

#define RTC_TAMPCAL_YEAR_Pos          ( 16 )                                               /*!< RTC_T::TAMPCAL: YEAR Position          */
#define RTC_TAMPCAL_YEAR_Msk          ( 0xful << RTC_TAMPCAL_YEAR_Pos )                    /*!< RTC_T::TAMPCAL: YEAR Mask              */

#define RTC_TAMPCAL_TENYEAR_Pos       ( 20 )                                               /*!< RTC_T::TAMPCAL: TENYEAR Position       */
#define RTC_TAMPCAL_TENYEAR_Msk       ( 0xful << RTC_TAMPCAL_TENYEAR_Pos )                 /*!< RTC_T::TAMPCAL: TENYEAR Mask           */

#define RTC_CLKDCTL_LXTFDEN_Pos       ( 0 )                                                /*!< RTC_T::CLKDCTL: LXTFDEN Position       */
#define RTC_CLKDCTL_LXTFDEN_Msk       ( 0x1ul << RTC_CLKDCTL_LXTFDEN_Pos )                 /*!< RTC_T::CLKDCTL: LXTFDEN Mask           */

#define RTC_CLKDCTL_LXTFSW_Pos        ( 1 )                                                /*!< RTC_T::CLKDCTL: LXTFSW Position        */
#define RTC_CLKDCTL_LXTFSW_Msk        ( 0x1ul << RTC_CLKDCTL_LXTFSW_Pos )                  /*!< RTC_T::CLKDCTL: LXTFSW Mask            */

#define RTC_CLKDCTL_LXTSPSW_Pos       ( 2 )                                                /*!< RTC_T::CLKDCTL: LXTSPSW Position       */
#define RTC_CLKDCTL_LXTSPSW_Msk       ( 0x1ul << RTC_CLKDCTL_LXTSPSW_Pos )                 /*!< RTC_T::CLKDCTL: LXTSPSW Mask           */

#define RTC_CLKDCTL_CLKSWLIRCF_Pos    ( 16 )                                               /*!< RTC_T::CLKDCTL: CLKSWLIRCF Position    */
#define RTC_CLKDCTL_CLKSWLIRCF_Msk    ( 0x1ul << RTC_CLKDCTL_CLKSWLIRCF_Pos )              /*!< RTC_T::CLKDCTL: CLKSWLIRCF Mask        */

#define RTC_CLKDCTL_LXTFASTF_Pos      ( 17 )                                               /*!< RTC_T::CLKDCTL: LXTFASTF Position      */
#define RTC_CLKDCTL_LXTFASTF_Msk      ( 0x1ul << RTC_CLKDCTL_LXTFASTF_Pos )                /*!< RTC_T::CLKDCTL: LXTFASTF Mask          */

#define RTC_CDBR_STOPBD_Pos           ( 0 )                                                /*!< RTC_T::CDBR: STOPBD Position           */
#define RTC_CDBR_STOPBD_Msk           ( 0xfful << RTC_CDBR_STOPBD_Pos )                    /*!< RTC_T::CDBR: STOPBD Mask               */

#define RTC_CDBR_FAILBD_Pos           ( 16 )                                               /*!< RTC_T::CDBR: FAILBD Position           */
#define RTC_CDBR_FAILBD_Msk           ( 0xfful << RTC_CDBR_FAILBD_Pos )                    /*!< RTC_T::CDBR: FAILBD Mask               */

/**@}*/ /* RTC_CONST */
/**@}*/ /* end of RTC register group */
/**@}*/ /* end of REGISTER group */

#endif /* __RTC_REG_H__ */
